emacs-config.org
#+TITLE: Emacs Configuration
#+AUTHOR: Ulf Ejlertsson
#+EMAIL: ulf.ejlertsson@gmail.com
#+OPTIONS: toc:3 num:nil

Emacs does not have namespaces, so I emulate Clojure namespaces by
using this prefix =ue=



* Set personal info explicit.
#+begin_src emacs-lisp
(setq user-full-name "Ulf Ejlertsson")
(setq user-mail-address "ulf.ejlertsson@gmail.com")
#+end_src

* Basic configuration

** The power of Common Lisp
#+begin_src emacs-lisp
(require 'cl)
#+end_src

** Misc utilites
Make Emacs reload changed files if you haven't also changed them in
Emacs (=global-auto-revert-mode=).
Winner Mode is great when you depend a lot on working with Emacs windows.
#+begin_src emacs-lisp
(global-auto-revert-mode t)
(winner-mode t)
#+end_src
Enable ANSI colors for the shell by default.
#+begin_src emacs-lisp
(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
#+end_src

Reload =.emacs= file (useful for editing .emacs itself :)
#+begin_src emacs-lisp
(defun reload-dotemacs ()
  "Reload .emacs"
  (interactive)
  (load-file "~/.emacs.d/init.el"))
(global-set-key "\M-e" 'reload-dotemacs)
#+end_src


* Packages
#+begin_src emacs-lisp
(require 'package)
(add-to-list 'package-archives
             '("marmalade" . "http://marmalade-repo.org/packages/") t)
(add-to-list 'package-archives
             '("melpa" . "http://melpa.milkbox.net/packages/") t)
(package-initialize)
#+end_src

* Startup options
** Spash screen
Turn of splash screen and the message.
#+begin_src emacs-lisp
(setq inhibit-splash-screen t
      initial-scratch-message nil)
#+end_src

** No beeping and 'y' for yes.
#+begin_src emacs-lisp
(setq visible-bell t)
(fset 'yes-or-no-p 'y-or-n-p)
#+end_src

** Scroll bar, tool bar and menu bar
Disable tool bar, the rest is fine on OSX
#+begin_src emacs-lisp
(when window-system
  (tool-bar-mode -1))
#+end_src

** Setting up the Emacs server
#+begin_src emacs-lisp
(server-start)
#+end_src

* Paths
Add the ~/bin to the Emacs shell path and fix the PATH variable on OS X
#+begin_src emacs-lisp
(add-to-list 'exec-path "/Users/ulf/bin")

(defun set-exec-path-from-shell-PATH ()
  (let ((path-from-shell (shell-command-to-string "$SHELL -i -c 'echo $PATH'")))
    (setenv "PATH" path-from-shell)
    (setq exec-path (split-string path-from-shell path-separator))))

(if window-system (set-exec-path-from-shell-PATH))
#+end_src

* Display settings
Set the default font, and set transparency.
#+begin_src emacs-lisp
(set-default-font "Menlo-10")
(setq mac-allow-anti-aliasing t)
(set-frame-parameter (selected-frame) 'alpha '(96 84))
(add-to-list 'default-frame-alist '(alpha 96 84))
(load-theme 'zenburn t)
#+end_src

Toggle transparency.
#+begin_src emacs-lisp
(defun toggle-transparency ()
  (interactive)
  (let ((param (cadr (frame-parameter nil 'alpha))))
    (if (and param (/= param 100))
        (set-frame-parameter nil 'alpha '(100 100))
      (set-frame-parameter nil 'alpha '(85 50)))))
(global-set-key (kbd "C-c t") 'toggle-transparency)

#+end_src

Make Emacs to fully redraw the display before it processes queued input events.
#+begin_src emacs-lisp
(setq redisplay-dont-pause t)
#+end_src

** Frame font, title and size
#+begin_src emacs-lisp
(if window-system (set-frame-font "Menlo-10"))
(if window-system (setq frame-title-format
  '("" invocation-name ": "(:eval (if (buffer-file-name)
                (abbreviate-file-name (buffer-file-name))
                  "%b")))))
(if (window-system)
  (set-frame-width (selected-frame) 190))

(defun lh-get-height-max ()
  (- (/ (cadddr (display-usable-bounds))
	(frame-char-height))
     2))

(defun lh-max-frames ()
  (interactive)
  (modify-all-frames-parameters (list (cons 'height (lh-get-height-max)))))
(lh-max-frames)
#+end_src

Make buffer names unique.
#+begin_src emacs-lisp
(require 'uniquify)
(setq
  uniquify-buffer-name-style 'post-forward
  uniquify-separator ":")
#+end_src

** Lines, columns, and parenthesis
Display the column number and line number i mode-line and also
highlight matching parenthesis.
#+begin_src emacs-lisp
(column-number-mode 1)
(line-number-mode t)
(setq show-paren-delay 0
      show-paren-style 'parenthesis)
(show-paren-mode 1)
#+end_src

** Time and date
Set the time format to 24hr format and display time, date and load
in the mode-line
#+begin_src emacs-lisp
(setq display-time-day-and-date t)
(setq display-time-24hr-format t)
(display-time-mode 1)
#+end_src

** Mouse and scrolling
Turn off native OSX scrolling while in terminal mode. Move the mouse
pointer out of the way when the cursor is near it.
#+begin_src emacs-lisp
;(when window-system
;  (mouse-wheel mode t))
(set-variable 'scroll-conservatively 5)
(mouse-avoidance-mode 'cat-and-mouse)
#+end_src

** Eshell
Enable Plan 9's terminal, the Eshell smart display
#+begin_src emacs-lisp
(require 'eshell)
(require 'em-smart)
(setq eshell-where-to-jump 'begin)
(setq eshell-review-quick-commands nil)
(setq eshell-smart-space-goes-to-end t)
#+end_src

Fix terminal in emacs (M-x term) under MacOS. Use Emacs terminfo, not system terminfo.
#+begin_src emacs-lisp
(setq system-uses-terminfo nil)
#+end_src


