emacs-config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs Configuration</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Emacs Configuration"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-04 19:15:43 CET"/>
<meta name="author" content="Ulf Ejlertsson"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Emacs Configuration</h1>

<p>Emacs does not have namespaces, so I emulate Clojure namespaces by
using this prefix <code>ue</code>
</p>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Set personal info explicit.</a></li>
<li><a href="#sec-2">Basic configuration</a>
<ul>
<li><a href="#sec-2-1">The power of Common Lisp</a></li>
<li><a href="#sec-2-2">Misc utilites</a></li>
</ul>
</li>
<li><a href="#sec-3">Packages</a></li>
<li><a href="#sec-4">Startup options</a>
<ul>
<li><a href="#sec-4-1">Spash screen</a></li>
<li><a href="#sec-4-2">No beeping and 'y' for yes.</a></li>
<li><a href="#sec-4-3">Scroll bar, tool bar and menu bar</a></li>
<li><a href="#sec-4-4">Setting up the Emacs server</a></li>
</ul>
</li>
<li><a href="#sec-5">Paths</a></li>
<li><a href="#sec-6">Display settings</a>
<ul>
<li><a href="#sec-6-1">Frame font, title and size</a></li>
<li><a href="#sec-6-2">Lines, columns, and parenthesis</a></li>
<li><a href="#sec-6-3">Time and date</a></li>
<li><a href="#sec-6-4">Mouse and scrolling</a></li>
<li><a href="#sec-6-5">Eshell</a></li>
<li><a href="#sec-6-6">Basic text editing</a></li>
</ul>
</li>
<li><a href="#sec-7">Key mapping</a>
<ul>
<li><a href="#sec-7-1">Remap meta key on OS X</a></li>
</ul>
</li>
<li><a href="#sec-8">Org mode</a>
<ul>
<li><a href="#sec-8-1">Enable <code>LaTeX</code> in Org mode</a></li>
<li><a href="#sec-8-2">Mobile org/Dropbox</a></li>
</ul>
</li>
<li><a href="#sec-9">Deft</a></li>
<li><a href="#sec-10">Magit</a></li>
<li><a href="#sec-11">IDO</a></li>
<li><a href="#sec-12">Supercharge recentf by adding Ido mode support</a></li>
<li><a href="#sec-13">Undo tree</a></li>
<li><a href="#sec-14">Smex</a></li>
<li><a href="#sec-15">Ack</a></li>
<li><a href="#sec-16">Sunrise Commander</a></li>
<li><a href="#sec-17">Yasnippets</a></li>
<li><a href="#sec-18">Programming</a>
<ul>
<li><a href="#sec-18-1">Add mode hooks</a></li>
<li><a href="#sec-18-2">C/C++</a>
<ul>
<li><a href="#sec-18-2-1">C</a></li>
<li><a href="#sec-18-2-2">C++</a></li>
<li><a href="#sec-18-2-3">Objective C</a></li>
</ul>
</li>
<li><a href="#sec-18-3">Lisp</a>
<ul>
<li><a href="#sec-18-3-1">Common Lisp</a></li>
<li><a href="#sec-18-3-2">Racket/Scheme</a></li>
<li><a href="#sec-18-3-3">Clojure</a></li>
</ul>
</li>
<li><a href="#sec-18-4">Erlang</a></li>
<li><a href="#sec-18-5">Haskell</a>
<ul>
<li><a href="#sec-18-5-1">Agda</a></li>
</ul>
</li>
<li><a href="#sec-18-6">Ocaml</a></li>
<li><a href="#sec-18-7">Python</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Set personal info explicit.</h2>
<div class="outline-text-2" id="text-1">




<pre class="example">(setq user-full-name "Ulf Ejlertsson")
(setq user-mail-address "ulf.ejlertsson@gmail.com")
</pre>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Basic configuration</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">The power of Common Lisp</h3>
<div class="outline-text-3" id="text-2-1">




<pre class="example">(require 'cl)
</pre>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">Misc utilites</h3>
<div class="outline-text-3" id="text-2-2">

<p>Make Emacs reload changed files if you haven't also changed them in
Emacs (<code>global-auto-revert-mode</code>).
Winner Mode is great when you depend a lot on working with Emacs windows.
</p>


<pre class="example">(global-auto-revert-mode t)
(winner-mode t)
</pre>

<p>
Enable ANSI colors for the shell by default.
</p>


<pre class="example">(add-hook 'shell-mode-hook 'ansi-color-for-comint-mode-on)
</pre>


<p>
Reload <code>.emacs</code> file (useful for editing .emacs itself :)
</p>


<pre class="example">(defun reload-dotemacs ()
  "Reload .emacs"
  (interactive)
  (load-file "~/.emacs.d/init.el"))
(global-set-key "\M-e" 'reload-dotemacs)
</pre>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Packages</h2>
<div class="outline-text-2" id="text-3">




<pre class="example">(require 'package)
(add-to-list 'package-archives
             '("marmalade" . "http://marmalade-repo.org/packages/") t)
(add-to-list 'package-archives
             '("melpa" . "http://melpa.milkbox.net/packages/") t)
(package-initialize)
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Startup options</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Spash screen</h3>
<div class="outline-text-3" id="text-4-1">

<p>Turn of splash screen and the message.
</p>


<pre class="example">(setq inhibit-splash-screen t
      initial-scratch-message nil)
</pre>


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">No beeping and 'y' for yes.</h3>
<div class="outline-text-3" id="text-4-2">




<pre class="example">(setq visible-bell t)
(fset 'yes-or-no-p 'y-or-n-p)
</pre>


</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">Scroll bar, tool bar and menu bar</h3>
<div class="outline-text-3" id="text-4-3">

<p>Disable tool bar, the rest is fine on OSX
</p>


<pre class="example">(when window-system
  (tool-bar-mode -1))
</pre>


</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4">Setting up the Emacs server</h3>
<div class="outline-text-3" id="text-4-4">




<pre class="example">(server-start)
</pre>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Paths</h2>
<div class="outline-text-2" id="text-5">

<p>Add the ~/bin to the Emacs shell path and fix the PATH variable on OS X
</p>


<pre class="example">(add-to-list 'exec-path "/Users/ulf/bin")

(defun set-exec-path-from-shell-PATH ()
  (let ((path-from-shell (shell-command-to-string "$SHELL -i -c 'echo $PATH'")))
    (setenv "PATH" path-from-shell)
    (setq exec-path (split-string path-from-shell path-separator))))

(if window-system (set-exec-path-from-shell-PATH))
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Display settings</h2>
<div class="outline-text-2" id="text-6">

<p>Set the default font, and set transparency.
</p>


<pre class="example">(set-default-font "Menlo-10")
(setq mac-allow-anti-aliasing t)
(set-frame-parameter (selected-frame) 'alpha '(96 84))
(add-to-list 'default-frame-alist '(alpha 96 84))
(load-theme 'zenburn t)
</pre>


<p>
Toggle transparency.
</p>


<pre class="example">(defun toggle-transparency ()
  (interactive)
  (let ((param (cadr (frame-parameter nil 'alpha))))
    (if (and param (/= param 100))
        (set-frame-parameter nil 'alpha '(100 100))
      (set-frame-parameter nil 'alpha '(85 50)))))
(global-set-key (kbd "C-c t") 'toggle-transparency)

</pre>


<p>
Make Emacs to fully redraw the display before it processes queued input events.
</p>


<pre class="example">(setq redisplay-dont-pause t)
</pre>



</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">Frame font, title and size</h3>
<div class="outline-text-3" id="text-6-1">




<pre class="example">(if window-system (set-frame-font "Menlo-10"))
(if window-system (setq frame-title-format
  '("" invocation-name ": "(:eval (if (buffer-file-name)
                (abbreviate-file-name (buffer-file-name))
                  "%b")))))
(if (window-system)
  (set-frame-width (selected-frame) 190))

(defun lh-get-height-max ()
  (- (/ (cadddr (display-usable-bounds))
        (frame-char-height))
     2))

(defun lh-max-frames ()
  (interactive)
  (modify-all-frames-parameters (list (cons 'height (lh-get-height-max)))))
(lh-max-frames)
</pre>


<p>
Make buffer names unique.
</p>


<pre class="example">(require 'uniquify)
(setq
  uniquify-buffer-name-style 'post-forward
  uniquify-separator ":")
</pre>


</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2">Lines, columns, and parenthesis</h3>
<div class="outline-text-3" id="text-6-2">

<p>Display the column number and line number i mode-line and also
highlight matching parenthesis.
</p>


<pre class="example">(column-number-mode 1)
(line-number-mode t)
(setq show-paren-delay 0
      show-paren-style 'parenthesis)
(show-paren-mode 1)
</pre>


</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3">Time and date</h3>
<div class="outline-text-3" id="text-6-3">

<p>Set the time format to 24hr format and display time, date and load
in the mode-line
</p>


<pre class="example">(setq display-time-day-and-date t)
(setq display-time-24hr-format t)
(display-time-mode 1)
</pre>


</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4">Mouse and scrolling</h3>
<div class="outline-text-3" id="text-6-4">

<p>Turn off native OSX scrolling while in terminal mode. Move the mouse
pointer out of the way when the cursor is near it.
</p>


<pre class="example">;(when window-system
;  (mouse-wheel mode t))
(set-variable 'scroll-conservatively 5)
(mouse-avoidance-mode 'cat-and-mouse)
</pre>


</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5">Eshell</h3>
<div class="outline-text-3" id="text-6-5">

<p>Enable Plan 9′s terminal, the Eshell smart display
</p>


<pre class="example">(require 'eshell)
(require 'em-smart)
(setq eshell-where-to-jump 'begin)
(setq eshell-review-quick-commands nil)
(setq eshell-smart-space-goes-to-end t)
</pre>


<p>
Fix terminal in emacs (M-x term) under MacOS. Use Emacs terminfo, not system terminfo.
</p>


<pre class="example">(setq system-uses-terminfo nil)
</pre>



</div>

</div>
