emacs-config.org
** Basic text editing
Always do syntax highlighting and require newline and stop at the last line.
#+begin_src emacs-lisp
(setq default-major-mode 'text-mode)
(global-font-lock-mode 1)
(setq require-final-newline t)
(setq next-line-add-newlines nil)
(setq whitespace-style '(trailing space-before-tab indentation empty space-after-tab))
;(add-hook 'before-save-hook 'delete-trailing-whitespace)
(add-hook 'after-save-hook 'delete-trailing-whitespace)
(setq fill-column 80)
(global-hl-line-mode +1)
(electric-indent-mode +1)
#+end_src

Also indent automagical by switching RET and LF.
#+begin_src emacs-lisp
(setq foo (global-key-binding "\C-m"))
(global-set-key "\C-m" (global-key-binding "\C-j"))
(global-set-key "\C-j" foo)
#+end_src

Hightlight marked region.
#+begin_src emacs-lisp
(transient-mark-mode t)
#+end_src

Fci-mode.
#+begin_src emacs-lisp
(require 'fill-column-indicator)
(setq fci-rule-width 2)
(setq fci-rule-color "#5b605e")

(define-globalized-minor-mode
  global-fci-mode fci-mode (lambda () (fci-mode 1)))
(global-fci-mode 1)
#+end_src

* Key mapping
F1 go to man page.
#+begin_src emacs-lisp
(global-set-key [(f1)] (lambda () (interactive) (manual-entry
(current-word) ) ) )
#+end_src

F2 find file.
#+begin_src emacs-lisp
(global-set-key [f2] 'find-file)
#+end_src

F3 Help.
#+begin_src emacs-lisp
(global-set-key [f3] 'help-command)
#+end_src

** Remap meta key on OS X
#+begin_src emacs-lisp
(setq mac-option-modifier nil
      mac-command-modifier 'meta
      x-select-enable-clipboard t)
#+end_src

* Auto complete
#+begin_src emacs-lisp
(require 'auto-complete-config)
(ac-config-default)
#+end_src
* Org mode
#+begin_src emacs-lisp
(require 'ob-tangle)
(add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map "\C-ca" 'org-agenda)
(setq org-export-with-LaTeX-fragments t)
(setq org-log-done t)
#+end_src

Enable /babel/ for some languages.
#+begin_src emacs-lisp
(org-babel-do-load-languages
 'org-babel-load-languages
  '( (haskell . t)
     ;;(clojure. t)
     (sh . t)
     (python . t)
     (emacs-lisp . t)
     (C . t)
     (ocaml . t)
   ))

(setq org-src-fontify-natively t)
(setq org-src-tab-acts-natively t)
#+end_src

** Enable =LaTeX= in Org mode
#+begin_src emacs-lisp
(require 'org-latex)
(unless (boundp 'org-export-latex-classes)
  (setq org-export-latex-classes nil))
(add-to-list 'org-export-latex-classes
             '("article"
               "\\documentclass{article}"
               ("\\section{%s}" . "\\section*{%s}")))

(setq org-export-latex-listings t)
(add-to-list 'org-export-latex-packages-alist '("" "listings"))
(add-to-list 'org-export-latex-packages-alist '("" "color"))
#+end_src

** Mobile org/Dropbox
Set the location of the =org= files on the local system, and the Dropbox
root directory.
#+begin_src emacs-lisp
(setq org-directory "~/org")
(setq org-mobile-directory "~/Dropbox/MobileOrg")
#+end_src
Set the name of the file where new notes will be stored.
#+begin_src emacs-lisp
(setq org-mobile-inbox-for-pull "~/org/inbox.org")
#+end_src

* Deft

#+begin_src emacs-lisp
     (setq deft-directory "~/Dropbox/org/deft")
     (setq deft-use-filename-as-title t)
     (setq deft-extension "org")
     (setq deft-text-mode 'org-mode)
   #+end_src
* LaTeX
Invoke the AUCTeX package.
#+begin_src emacs-lisp
(require 'tex-site)
#+end_src

* Magit
Bind C-x g to magit-status and show magit status in full screen.
#+begin_src emacs-lisp
(eval-after-load 'magit '(require 'magit))

(global-set-key (kbd "C-x g") 'magit-status)

(defadvice magit-status (around magit-fullscreen activate)
  (window-configuration-to-register :magit-fullscreen)
  ad-do-it
  (delete-other-windows))

(defun magit-quit-session ()
  "Restores the previous window configuration and kills the magit buffer"
  (interactive)
  (kill-buffer)
  (jump-to-register :magit-fullscreen))

;(define-key magit-status-mode-map (kbd "q") 'magit-quit-session)
#+end_src

* Git gutter
#+begin_src emacs-lisp
(global-git-gutter-mode t)
(setq git-gutter:modified-sign "  ") ;; two space
(setq git-gutter:added-sign "++")    ;; multiple character is OK
(setq git-gutter:deleted-sign "--")

(set-face-background 'git-gutter:modified "purple") ;; background color
(set-face-foreground 'git-gutter:added "green")
(set-face-foreground 'git-gutter:deleted "red")
(setq git-gutter:window-width 2)
#+end_src

* IDO
Ido stands for Interactively Do Things.
=ido-ubiquitous= takes the power of ido and lets you use it almost everywhere.
=ido-enable-flex-matching= gives me fuzzy-finding and
=ido-use-virtual-buffers= lets me switch to (and re-open) closed buffers
from my buffer search.
#+begin_src emacs-lisp
  (ido-mode t)
  (ido-ubiquitous t)
  (setq ido-enable-flex-matching t
        ido-use-virtual-buffers t)
#+end_src

* Helm
#+begin_src emacs-lisp
(require 'helm-config)
#+end_src
* Autopair-mode
#+begin_src emacs-lisp
(require 'autopair)
#+end_src
* Supercharge recentf by adding Ido mode support
#+begin_src emacs-lisp
(require 'recentf)

;; get rid of `find-file-read-only' and replace it with something
;; more useful.
(global-set-key (kbd "C-x C-r") 'ido-recentf-open)

;; enable recent files mode.
(recentf-mode t)

; 50 files ought to be enough.
(setq recentf-max-saved-items 50)

(defun ido-recentf-open ()
  "Use `ido-completing-read' to \\[find-file] a recent file"
  (interactive)
  (if (find-file (ido-completing-read "Find recent file: " recentf-list))
      (message "Opening file...")
    (message "Aborting")))
#+end_src

* Undo tree
#+begin_src emacs-lisp
(require 'undo-tree)
#+end_src

* Smex
Smex is a replacement for the default behavior of =M-x= with better
history and completion.
#+begin_src emacs-lisp
  (require 'smex)
  (setq smex-save-file (expand-file-name ".smex-items" user-emacs-directory))
  (smex-initialize)
  (global-set-key (kbd "M-x") 'smex)
  (global-set-key (kbd "M-X") 'smex-major-mode-commands)
  ;; This is your old M-x.
  (global-set-key (kbd "C-c C-c M-x") 'execute-extended-command)
#+end_src

* Ack
=ack= is an enhanced grep.
#+begin_src emacs-lisp
  (setq ack-prompt-for-directory t)
  (setq ack-executable (executable-find "ack-grep"))
#+end_src

* Sunrise Commander
#+begin_src emacs-lisp
(require 'sunrise-commander)
#+end_src


* Projectile
#+begin_src emacs-lisp
(projectile-global-mode)
#+end_src
* Yasnippets
Enable yasnippet
#+begin_src emacs-lisp
(require 'yasnippet)
(yas/global-mode 1)
(yas/load-directory "~/.emacs.d/elpa/yasnippet-20130218.2229/snippets")
#+end_src

* Programming

** Add mode hooks
#+begin_src emacs-lisp
(add-hook 'c-mode-hook        'flyspell-prog-mode 1)
(add-hook 'c++-mode-hook      'flyspell-prog-mode 1)
(add-hook 'makefile-mode-hook 'flyspell-prog-mode 1)
(add-hook 'python-mode-hook   'flyspell-prog-mode 1)
(add-hook 'sh-mode-hook       'flyspell-prog-mode 1)
(add-hook 'c-mode-common-hook 'turn-on-auto-fill)
(add-hook 'c++-mode-common-hook ' turn-on-auto-fill)
(add-hook 'prog-mode-hook 'flyspell-prog-mode 1)
#+end_src

** C/C++
#+begin_src emacs-lisp
(require 'cc-mode)
#+end_src

