emacs-config.html

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6">Basic text editing</h3>
<div class="outline-text-3" id="text-6-6">

<p>Always do syntax highlighting and require newline and stop at the last line.
</p>


<pre class="example">(setq default-major-mode 'text-mode)
(global-font-lock-mode 1)
(setq require-final-newline t)
(setq next-line-add-newlines nil)
(setq whitespace-style '(trailing space-before-tab indentation empty space-after-tab))
;(add-hook 'before-save-hook 'delete-trailing-whitespace)
(add-hook 'after-save-hook 'delete-trailing-whitespace)
(setq fill-column 80)
(global-hl-line-mode 1)
</pre>


<p>
Also indent automagical by switching RET and LF.
</p>


<pre class="example">(setq foo (global-key-binding "\C-m"))
(global-set-key "\C-m" (global-key-binding "\C-j"))
(global-set-key "\C-j" foo)
</pre>


<p>
Hightlight marked region.
</p>


<pre class="example">(transient-mark-mode t)
</pre>


<p>
Fci-mode.
</p>


<pre class="example">(require 'fill-column-indicator)
(setq fci-rule-width 2)
(setq fci-rule-color "#5b605e")

(define-globalized-minor-mode
  global-fci-mode fci-mode (lambda () (fci-mode 1)))
(global-fci-mode 1)
</pre>


</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Key mapping</h2>
<div class="outline-text-2" id="text-7">

<p>F1 go to man page.
</p>


<pre class="example">(global-set-key [(f1)] (lambda () (interactive) (manual-entry
(current-word) ) ) )
</pre>


<p>
F2 find file.
</p>


<pre class="example">(global-set-key [f2] 'find-file)
</pre>


<p>
F3 Help.
</p>


<pre class="example">(global-set-key [f3] 'help-command)
</pre>



</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1">Remap meta key on OS X</h3>
<div class="outline-text-3" id="text-7-1">




<pre class="example">(setq mac-option-modifier nil
      mac-command-modifier 'meta
      x-select-enable-clipboard t)
</pre>


</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">Org mode</h2>
<div class="outline-text-2" id="text-8">




<pre class="example">(require 'ob-tangle)
(add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
(define-key global-map "\C-cl" 'org-store-link)
(define-key global-map "\C-ca" 'org-agenda)
(setq org-export-with-LaTeX-fragments t)
(setq org-log-done t)
</pre>


<p>
Enable <i>babel</i> for some languages.
</p>


<pre class="example">(org-babel-do-load-languages
 'org-babel-load-languages
  '( (haskell . t)
     ;;(clojure. t)
     (sh . t)
     (python . t)
     (emacs-lisp . t)
     (C . t)
     (ocaml . t)
   ))

(setq org-src-fontify-natively t)
(setq org-src-tab-acts-natively t)
</pre>



</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1">Enable <code>LaTeX</code> in Org mode</h3>
<div class="outline-text-3" id="text-8-1">




<pre class="example">(require 'org-latex)
(unless (boundp 'org-export-latex-classes)
  (setq org-export-latex-classes nil))
(add-to-list 'org-export-latex-classes
             '("article"
               "\\documentclass{article}"
               ("\\section{%s}" . "\\section*{%s}")))

(setq org-export-latex-listings t)
(add-to-list 'org-export-latex-packages-alist '("" "listings"))
(add-to-list 'org-export-latex-packages-alist '("" "color"))
</pre>


</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2">Mobile org/Dropbox</h3>
<div class="outline-text-3" id="text-8-2">

<p>Set the location of the <code>org</code> files on the local system, and the Dropbox
root directory.
</p>


<pre class="example">(setq org-directory "~/org")
(setq org-mobile-directory "~/Dropbox/MobileOrg")
</pre>

<p>
Set the name of the file where new notes will be stored.
</p>


<pre class="example">(setq org-mobile-inbox-for-pull "~/org/inbox.org")
</pre>


</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">Deft</h2>
<div class="outline-text-2" id="text-9">




<pre class="example">(setq deft-directory "~/Dropbox/org/deft")
(setq deft-use-filename-as-title t)
(setq deft-extension "org")
(setq deft-text-mode 'org-mode)
</pre>

</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">Magit</h2>
<div class="outline-text-2" id="text-10">

<p>Bind C-x g to magit-status and show magit status in full screen.
</p>


<pre class="example">(eval-after-load 'magit '(require 'magit))

(global-set-key (kbd "C-x g") 'magit-status)

(defadvice magit-status (around magit-fullscreen activate)
  (window-configuration-to-register :magit-fullscreen)
  ad-do-it
  (delete-other-windows))

(defun magit-quit-session ()
  "Restores the previous window configuration and kills the magit buffer"
  (interactive)
  (kill-buffer)
  (jump-to-register :magit-fullscreen))

;(define-key magit-status-mode-map (kbd "q") 'magit-quit-session)
</pre>


</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">IDO</h2>
<div class="outline-text-2" id="text-11">

<p>Ido stands for Interactively Do Things.
<code>ido-ubiquitous</code> takes the power of ido and lets you use it almost everywhere.
<code>ido-enable-flex-matching</code> gives me fuzzy-finding and
<code>ido-use-virtual-buffers</code> lets me switch to (and re-open) closed buffers
from my buffer search.
</p>


<pre class="example">(ido-mode t)
(ido-ubiquitous t)
(setq ido-enable-flex-matching t
      ido-use-virtual-buffers t)
</pre>



</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">Supercharge recentf by adding Ido mode support</h2>
<div class="outline-text-2" id="text-12">




<pre class="example">(require 'recentf)

;; get rid of `find-file-read-only' and replace it with something
;; more useful.
(global-set-key (kbd "C-x C-r") 'ido-recentf-open)

;; enable recent files mode.
(recentf-mode t)

; 50 files ought to be enough.
(setq recentf-max-saved-items 50)

(defun ido-recentf-open ()
  "Use `ido-completing-read' to \\[find-file] a recent file"
  (interactive)
  (if (find-file (ido-completing-read "Find recent file: " recentf-list))
      (message "Opening file...")
    (message "Aborting")))
</pre>


</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">Undo tree</h2>
<div class="outline-text-2" id="text-13">




<pre class="example">(require 'undo-tree)
</pre>


</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14">Smex</h2>
<div class="outline-text-2" id="text-14">

<p>Smex is a replacement for the default behavior of <code>M-x</code> with better
history and completion.
</p>


<pre class="example">(require 'smex)
(setq smex-save-file (expand-file-name ".smex-items" user-emacs-directory))
(smex-initialize)
(global-set-key (kbd "M-x") 'smex)
(global-set-key (kbd "M-X") 'smex-major-mode-commands)
;; This is your old M-x.
(global-set-key (kbd "C-c C-c M-x") 'execute-extended-command)
</pre>


</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15">Ack</h2>
<div class="outline-text-2" id="text-15">

<p><code>ack</code> is an enhanced grep.
</p>


<pre class="example">(setq ack-prompt-for-directory t)
(setq ack-executable (executable-find "ack-grep"))
</pre>


</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16">Sunrise Commander</h2>
<div class="outline-text-2" id="text-16">




<pre class="example">(require 'sunrise-commander)
</pre>


</div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17">Yasnippets</h2>
<div class="outline-text-2" id="text-17">

<p>Enable yasnippet
</p>


<pre class="example">(require 'yasnippet)
(yas/global-mode 1)
(yas/load-directory "~/.emacs.d/elpa/yasnippet-20121225.430/snippets")
</pre>


</div>

</div>

<div id="outline-container-18" class="outline-2">
<h2 id="sec-18">Programming</h2>
<div class="outline-text-2" id="text-18">



</div>

<div id="outline-container-18-1" class="outline-3">
<h3 id="sec-18-1">Add mode hooks</h3>
<div class="outline-text-3" id="text-18-1">




<pre class="example">(add-hook 'c-mode-hook        'flyspell-prog-mode 1)
(add-hook 'c++-mode-hook      'flyspell-prog-mode 1)
(add-hook 'makefile-mode-hook 'flyspell-prog-mode 1)
(add-hook 'python-mode-hook   'flyspell-prog-mode 1)
(add-hook 'sh-mode-hook       'flyspell-prog-mode 1)
(add-hook 'c-mode-common-hook 'turn-on-auto-fill)
(add-hook 'c++-mode-common-hook ' turn-on-auto-fill)

</pre>


</div>

</div>
