emacs-config.org
*** C
#+begin_src emacs-lisp
(add-hook 'c-mode-common-hook 'turn-on-auto-fill)

(add-hook 'c-mode-hook (function (lambda()
                  (c-set-style "bsd")
                  (setq c-basic-offset 8)
                  (setq indent-tabs-mode nil)
                  ) ) )
#+end_src

*** C++
#+begin_src emacs-lisp
(defun ue-c-namespace-open-indent (langelem)
  "Used with c-set-offset, indents namespace opening braces to the same indentation as the line on which the namespace declaration starts."
  (save-excursion
    (goto-char (cdr langelem))
    (let ((column (current-column)))
      (beginning-of-line)
      (skip-chars-forward " \t")
      (- (current-column) column)))
  )

(defun ue-c-namespace-indent (langelem)
  "Used with c-set-offset, indents namespace scope elements 2 spaces
from the namespace declaration iff the open brace sits on a line by itself."
  (save-excursion
    (if (progn (goto-char (cdr langelem))
               (setq column (current-column))
               (end-of-line)
               (while (and (search-backward "{" nil t)
                           (assoc 'incomment (c-guess-basic-syntax))))
               (skip-chars-backward " \t")
               (bolp))
        2)))

(add-hook 'c++-mode-common-hook ' turn-on-auto-fill)

(add-hook 'c++-mode-hook (function (lambda()
                    (c-set-style "bsd")
		        (c-set-offset 'innamespace 'ue-c-namespace-indent)
			    (c-set-offset 'namespace-open 'ue-c-namespace-open-indent)
			        (c-set-offset 'access-label -3)
                    (setq c-basic-offset 4)
                    (setq indent-tabs-mode nil)
                    ) ))
#+end_src

**** Clang
Autocomplete with =clang=.
#+begin_src emacs-lisp
(add-to-list 'load-path "~/.emacs.d" "~/Dev/svn/llvm/tools/clang/utils")
;;(setq load-path (cons "~/.emacs.d" "~/Dev/svn/llvm/trunk/tools/clang/utils"))
;;(setq ac-sources '(ac-source-clang-complete))
;;(setq ac-auto-start nil)
;;(define-key c-mode-base-map (kbd "M-/") 'auto-complete)
#+end_src

Syntax highlighting mode for LLVM assembly files.
#+begin_src emacs-lisp
  (setq load-path
    (cons (expand-file-name "~/Dev/svn/llvm/utils/emacs") load-path))
  (require 'llvm-mode)
#+end_src

Syntax highlighting mode for TableGen description files (tablegen-mode.el).
#+begin_src emacs-lisp
  (setq load-path
    (cons (expand-file-name "~/Dev/svn/llvm/utils/emacs/tablegen-mode.el") load-path))
  (require 'tablegen-mode)
#+end_src

*** Objective C
#+begin_src emacs-lips
(autoload 'objc-mode "cc-mode" "Objective-C Editing Mode" t)
#+end_src


** Lisp
Every Lisp needs a pretty lambda character.
#+begin_src emacs-lis
(defun ue-pretty-lambdas ()
  "Display the word "lambda" by "λ"."
  (font-lock-add-keywords
   nil
   `(("\\(lambda\\>\\)"
      (0
       (progn
	 (compose-region (match-beginning 1) (match-end 1) "λ")
	 'font-lock-keyword-face))))))

(add-hook 'emacs-lisp-mode-hook 'ue-pretty-lambdas)
(add-hook 'lisp-mode-hook 'ue-pretty-lambdas)
#+end_src

Enable rainbow delimiters.
#+begin_src emacs-lisp
(require 'rainbow-delimiters)
(global-rainbow-delimiters-mode)
#+end_src

Enable 'hightlight-parentheses-mode'.
#+begin_src emacs-lisp
(require 'highlight-parentheses)
#+end_src

Enable =paredit=.
#+begin_src emacs-lisp
(require 'paredit)
#+end_src

Shen-mode.
#+begin_src emacs-lisp
(require 'shen-mode)
(require 'inf-shen) ; <- for interaction with an external shen process
#+end_src

*** Common Lisp
Enable =slime= for Lisp.
#+begin_src emacs-lisp
(setq inferior-lisp-program "/Applications/Clozure\ CL.app")
     (require 'slime-autoloads)
#+end_src

*** Racket/Scheme
Enable =geiser= and =quack= for scheme/racket.
#+begin_src emacs-lisp
(setq geiser-active-implementations '(racket))

;; quack mode settings for scheme
(autoload 'quack "quack" nil t)

;; This hook lets you use your theme colours instead of quack's ones.
(defun scheme-mode-quack-hook ()
  (setq quack-global-menu-p nil)
  ;;(require 'quack)
  (quack-pretty-lambda-p t)
  (setq quack-fontify-style 'emacs))

(add-hook 'scheme-mode-hook 'scheme-mode-quack-hook)

#+end_src

*** Clojure
Enable =clojure-mode= and =nrepl=.
#+begin_src emacs-lisp
(require 'clojure-mode)
(require 'nrepl)

(require 'ac-nrepl)
(add-hook 'nrepl-mode-hook 'ac-nrepl-setup)
(add-hook 'nrepl-interaction-mode-hook 'ac-nrepl-setup)
(eval-after-load "auto-complete"
  '(add-to-list 'ac-modes 'nrepl-mode))

(defun set-auto-complete-as-completion-at-point-function ()
  (setq completion-at-point-functions '(auto-complete)))
(add-hook 'auto-complete-mode-hook 'set-auto-complete-as-completion-at-point-function)

(add-hook 'nrepl-mode-hook 'set-auto-complete-as-completion-at-point-function)
(add-hook 'nrepl-interaction-mode-hook 'set-auto-complete-as-completion-at-point-function)

(define-key nrepl-interaction-mode-map (kbd "C-c C-d") 'ac-nrepl-popup-doc)

(add-hook 'clojure-mode-hook
          (lambda ()
            (setq inferior-lisp-program "lein repl")))

(add-hook 'clojure-mode-hook
	  (lambda ()
	    (paraedit-mode +1)))
#+end_src
Enable =auto-fill= mode.
#+begin_src emacs-lisp
(add-hook 'clojure-mode-hook 'auto-fill-mode)
#+end_src

Due to syntax differences with other Lisp-like languages, Clojure is
better suited to a =fill-column= value of 80.
#+begin_src emacs-lisp
(add-hook 'clojure-mode-hook (lambda () (set-fill-column 80)(fci-mode)))
#+end_src

Clojure needs some help with indenting.
#+begin_src emacs-lisp
(put 'match 'clojure-indent-function 1)
(put 'if 'clojure-indent-function 0) ;; Really??
#+end_src

Enable =eldoc= in clojure buffers.
#+begin_src emacs-lisp
(add-hook 'nrepl-interaction-mode-hook
  'nrepl-turn-on-eldoc-mode)
#+end_src

Stop the error buffer from popping up while working in the =REPL= buffer.
#+begin_src emacs-lisp
(setq nrepl-popup-stacktraces nil)
#+end_src

Make =C-c C-z= switch to the =*nrepl*= buffer in the current window.
#+begin_src emacs-lisp
(add-to-list 'same-window-buffer-names "*nrepl*")
#+end_src

Turn on the =paredit= for clojure.
#+begin_src emacs-lisp
(defun turn-on-paredit () (paredit-mode 1))
(add-hook 'clojure-mode-hook 'turn-on-paredit)
(add-hook 'nrepl-mode-hook 'paredit-mode)
#+end_src

Add some bling.
#+begin_src emacs-lisp
(eval-after-load 'clojure-mode
  '(font-lock-add-keywords
    'clojure-mode `(("(\\(fn\\)[\[[:space:]]"
                     (0 (progn (compose-region (match-beginning 1)
                                               (match-end 1) "λ")
                               nil))))))

(eval-after-load 'clojure-mode
  '(font-lock-add-keywords
    'clojure-mode `(("\\(#\\)("
                     (0 (progn (compose-region (match-beginning 1)
                                               (match-end 1) "ƒ")
                               nil))))))

(eval-after-load 'clojure-mode
  '(font-lock-add-keywords
    'clojure-mode `(("\\(#\\){"
                     (0 (progn (compose-region (match-beginning 1)
                                               (match-end 1) "∈")
                               nil))))))
#+end_src

