emacs-config.html

<div id="outline-container-18-2" class="outline-3">
<h3 id="sec-18-2">C/C++</h3>
<div class="outline-text-3" id="text-18-2">




<pre class="example">(require 'cc-mode)
</pre>



</div>

<div id="outline-container-18-2-1" class="outline-4">
<h4 id="sec-18-2-1">C</h4>
<div class="outline-text-4" id="text-18-2-1">




<pre class="example">(add-hook 'c-mode-common-hook 'turn-on-auto-fill)

(add-hook 'c-mode-hook (function (lambda()
                  (c-set-style "bsd")
                  (setq c-basic-offset 8)
                  (setq indent-tabs-mode nil)
                  ) ) )
</pre>


</div>

</div>

<div id="outline-container-18-2-2" class="outline-4">
<h4 id="sec-18-2-2">C++</h4>
<div class="outline-text-4" id="text-18-2-2">




<pre class="example">(defun ue-c-namespace-open-indent (langelem)
  "Used with c-set-offset, indents namespace opening braces to the same indentation as the line on which the namespace declaration starts."
  (save-excursion
    (goto-char (cdr langelem))
    (let ((column (current-column)))
      (beginning-of-line)
      (skip-chars-forward " \t")
      (- (current-column) column)))
  )

(defun ue-c-namespace-indent (langelem)
  "Used with c-set-offset, indents namespace scope elements 2 spaces
from the namespace declaration iff the open brace sits on a line by itself."
  (save-excursion
    (if (progn (goto-char (cdr langelem))
               (setq column (current-column))
               (end-of-line)
               (while (and (search-backward "{" nil t)
                           (assoc 'incomment (c-guess-basic-syntax))))
               (skip-chars-backward " \t")
               (bolp))
        2)))

(add-hook 'c++-mode-common-hook ' turn-on-auto-fill)

(add-hook 'c++-mode-hook (function (lambda()
                    (c-set-style "bsd")
                        (c-set-offset 'innamespace 'ue-c-namespace-indent)
                            (c-set-offset 'namespace-open 'ue-c-namespace-open-indent)
                                (c-set-offset 'access-label -3)
                    (setq c-basic-offset 4)
                    (setq indent-tabs-mode nil)
                    ) ))
</pre>


<ul>
<li id="sec-18-2-2-1">Clang<br/>
Autocomplete with <code>clang</code>.



<pre class="example">(add-to-list 'load-path "~/.emacs.d" "~/Dev/svn/llvm/tools/clang/utils")
;;(setq load-path (cons "~/.emacs.d" "~/Dev/svn/llvm/trunk/tools/clang/utils"))
;;(setq ac-sources '(ac-source-clang-complete))
;;(setq ac-auto-start nil)
;;(define-key c-mode-base-map (kbd "M-/") 'auto-complete)
</pre>


<p>
Syntax highlighting mode for LLVM assembly files.
</p>


<pre class="example">(setq load-path
  (cons (expand-file-name "~/Dev/svn/llvm/utils/emacs") load-path))
(require 'llvm-mode)
</pre>


<p>
Syntax highlighting mode for TableGen description files (tablegen-mode.el).
</p>


<pre class="example">(setq load-path
  (cons (expand-file-name "~/Dev/svn/llvm/utils/emacs/tablegen-mode.el") load-path))
(require 'tablegen-mode)
</pre>


</li>
</ul>
</div>

</div>

<div id="outline-container-18-2-3" class="outline-4">
<h4 id="sec-18-2-3">Objective C</h4>
<div class="outline-text-4" id="text-18-2-3">




<pre class="example">(autoload 'objc-mode "cc-mode" "Objective-C Editing Mode" t)
</pre>



</div>
</div>

</div>

<div id="outline-container-18-3" class="outline-3">
<h3 id="sec-18-3">Lisp</h3>
<div class="outline-text-3" id="text-18-3">

<p>Every Lisp needs a pretty lambda character.
</p>


<pre class="example">(defun ue-pretty-lambdas ()
  "Display the word “lambda” by “λ”."
  (font-lock-add-keywords
   nil
   `(("\\(lambda\\&gt;\\)"
      (0
       (progn
         (compose-region (match-beginning 1) (match-end 1) "λ")
         'font-lock-keyword-face))))))

(add-hook 'emacs-lisp-mode-hook 'ue-pretty-lambdas)
(add-hook 'lisp-mode-hook 'ue-pretty-lambdas)
</pre>


<p>
Enable rainbow delimiters.
</p>


<pre class="example">(require 'rainbow-delimiters)
(global-rainbow-delimiters-mode)
</pre>


<p>
Enable 'hightlight-parentheses-mode'.
</p>


<pre class="example">(require 'highlight-parentheses)
</pre>


<p>
Enable <code>paredit</code>.
</p>


<pre class="example">(require 'paredit)
</pre>


<p>
Shen-mode.
</p>


<pre class="example">(require 'shen-mode)
(require 'inf-shen) ; &lt;- for interaction with an external shen process
</pre>



</div>

<div id="outline-container-18-3-1" class="outline-4">
<h4 id="sec-18-3-1">Common Lisp</h4>
<div class="outline-text-4" id="text-18-3-1">

<p>Enable <code>slime</code> for Lisp.
</p>


<pre class="example">(setq inferior-lisp-program "/Applications/Clozure\ CL.app")
     (require 'slime-autoloads)
</pre>


</div>

</div>

<div id="outline-container-18-3-2" class="outline-4">
<h4 id="sec-18-3-2">Racket/Scheme</h4>
<div class="outline-text-4" id="text-18-3-2">

<p>Enable <code>geiser</code> and <code>quack</code> for scheme/racket.
</p>


<pre class="example">(setq geiser-active-implementations '(racket))
(require 'quack)
(setq quack-global-menu-p nil)
</pre>


</div>

</div>

<div id="outline-container-18-3-3" class="outline-4">
<h4 id="sec-18-3-3">Clojure</h4>
<div class="outline-text-4" id="text-18-3-3">

<p>Enable <code>clojure-mode</code> and <code>nrepl</code>.
</p>


<pre class="example">(require 'clojure-mode)
(require 'nrepl)

(require 'ac-nrepl)
(add-hook 'nrepl-mode-hook 'ac-nrepl-setup)
(add-hook 'nrepl-interaction-mode-hook 'ac-nrepl-setup)
(eval-after-load "auto-complete"
  '(add-to-list 'ac-modes 'nrepl-mode))

(defun set-auto-complete-as-completion-at-point-function ()
  (setq completion-at-point-functions '(auto-complete)))
(add-hook 'auto-complete-mode-hook 'set-auto-complete-as-completion-at-point-function)

(add-hook 'nrepl-mode-hook 'set-auto-complete-as-completion-at-point-function)
(add-hook 'nrepl-interaction-mode-hook 'set-auto-complete-as-completion-at-point-function)

(define-key nrepl-interaction-mode-map (kbd "C-c C-d") 'ac-nrepl-popup-doc)

(add-hook 'clojure-mode-hook
          (lambda ()
            (setq inferior-lisp-program "lein repl")))

(add-hook 'clojure-mode-hook
          (lambda ()
            (paraedit-mode +1)))
</pre>

<p>
Enable <code>auto-fill</code> mode.
</p>


<pre class="example">(add-hook 'clojure-mode-hook 'auto-fill-mode)
</pre>


<p>
Due to syntax differences with other Lisp-like languages, Clojure is
better suited to a <code>fill-column</code> value of 80.
</p>


<pre class="example">(add-hook 'clojure-mode-hook (lambda () (set-fill-column 80)(fci-mode)))
</pre>


<p>
Clojure needs some help with indenting.
</p>


<pre class="example">(put 'match 'clojure-indent-function 1)
(put 'if 'clojure-indent-function 0) ;; Really??
</pre>


<p>
Enable <code>eldoc</code> in clojure buffers.
</p>


<pre class="example">(add-hook 'nrepl-interaction-mode-hook
  'nrepl-turn-on-eldoc-mode)
</pre>


<p>
Stop the error buffer from popping up while working in the <code>REPL</code> buffer.
</p>


<pre class="example">(setq nrepl-popup-stacktraces nil)
</pre>


<p>
Make <code>C-c C-z</code> switch to the <code>*nrepl*</code> buffer in the current window.
</p>


<pre class="example">(add-to-list 'same-window-buffer-names "*nrepl*")
</pre>


<p>
Turn on the <code>paredit</code> for clojure.
</p>


<pre class="example">(defun turn-on-paredit () (paredit-mode 1))
(add-hook 'clojure-mode-hook 'turn-on-paredit)
(add-hook 'nrepl-mode-hook 'paredit-mode)
</pre>


<p>
Add some bling.
</p>


<pre class="example">(eval-after-load 'clojure-mode
  '(font-lock-add-keywords
    'clojure-mode `(("(\\(fn\\)[\[[:space:]]"
                     (0 (progn (compose-region (match-beginning 1)
                                               (match-end 1) "λ")
                               nil))))))

(eval-after-load 'clojure-mode
  '(font-lock-add-keywords
    'clojure-mode `(("\\(#\\)("
                     (0 (progn (compose-region (match-beginning 1)
                                               (match-end 1) "ƒ")
                               nil))))))

(eval-after-load 'clojure-mode
  '(font-lock-add-keywords
    'clojure-mode `(("\\(#\\){"
                     (0 (progn (compose-region (match-beginning 1)
                                               (match-end 1) "∈")
                               nil))))))
</pre>


</div>
</div>

</div>
