emacs-config.html

<div id="outline-container-18-4" class="outline-3">
<h3 id="sec-18-4">Erlang</h3>
<div class="outline-text-3" id="text-18-4">

<p>Setup Erlang mode.
</p>


<pre class="example">(add-to-list
   'load-path
       (car (file-expand-wildcards "/usr/local/lib/erlang/lib/tools-*/emacs")))
(setq erlang-root-dir "/usr/local/lib/erlang")
(setq exec-path (cons "/usr/local/lib/erlang/bin" exec-path))
(require 'erlang-start)
(require 'erlang-flymake)
(defvar inferior-erlang-prompt-timeout t)

(add-to-list 'auto-mode-alist '("\\.erl?$" . erlang-mode))
(add-to-list 'auto-mode-alist '("\\.hrl?$" . erlang-mode))

(add-to-list 'load-path "/usr/local/share/distel/elisp")
(require 'distel)
(distel-setup)

;; FlyMake for Erlang.
(require 'flymake)
(setq flymake-gui-warnings-enabled nil)
(setq flymake-log-level 3)
(erlang-flymake-only-on-save)

;(require 'flymake)
(defun flymake-erlang-init ()
  (let* ((temp-file (flymake-init-create-temp-buffer-copy
                     'flymake-create-temp-inplace))
         (local-file (file-relative-name temp-file
                (file-name-directory buffer-file-name))))
    (list "~/bin/eflymake" (list local-file))))

(add-to-list 'flymake-allowed-file-name-masks '("\\.erl\\'" flymake-erlang-init))

(defun ue-erlang-mode-hook ()
        ;; when starting an Erlang shell in Emacs, default in the node name
        (setq inferior-erlang-machine-options '("-sname" "emacs"))
        ;; add Erlang functions to an imenu menu
        (imenu-add-to-menubar "imenu")
        ;; customize keys
        (local-set-key [return] 'newline-and-indent)
        (flymake-mode 1)
        )
;; Some Erlang customizations
(add-hook 'erlang-mode-hook 'ue-erlang-mode-hook)



(defun ue-erlang-mode-hook ()
(flymake-mode 1))

(add-hook 'erlang-mode-hook 'ue-erlang-mode-hook)
</pre>



</div>

</div>

<div id="outline-container-18-5" class="outline-3">
<h3 id="sec-18-5">Haskell</h3>
<div class="outline-text-3" id="text-18-5">




<pre class="example">(require 'haskell-mode)
(add-hook 'haskell-mode-hook 'turn-on-haskell-doc-mode)
(add-hook 'haskell-mode-hook 'turn-on-haskell-indent)
(add-hook 'haskell-mode-hook 'font-lock-mode)

(add-hook 'haskell-mode-hook 'turn-on-haskell-font-lock)
(setq haskell-font-lock-symbols t)

 (autoload 'ghc-init "ghc" nil t)
 (add-hook 'haskell-mode-hook
           (lambda ()
               (ghc-init)
               (flymake-mode)
               (require 'auto-complete-config)
               (auto-complete-mode t)
               (add-to-list 'ac-sources 'ac-source-ghc-mod)))
;; haskell-mode hooks
(add-hook 'haskell-mode-hook 'capitalized-words-mode)
(add-hook 'haskell-mode-hook 'turn-on-haskell-decl-scan)
(defun pretty-lambdas-haskell ()
  (font-lock-add-keywords
   nil `((,(concat "\\(" (regexp-quote "\\") "\\)")
          (0 (progn (compose-region (match-beginning 1) (match-end 1)
                                    ,(make-char 'greek-iso8859-7 107))
                    nil))))))

(add-hook 'haskell-mode-hook (lambda () (ghc-init) (flymake-mode)))


(add-hook 'haskell-mode-hook 'pretty-lambdas-haskell)

(eval-after-load 'haskell-font-lock
 '(setq haskell-font-lock-symbols-alist
        (delq nil
              (mapcar (lambda (rewrite)
                        (if (member (car rewrite) '("-&gt;" "&lt;-"))
                            nil rewrite))
                      haskell-font-lock-symbols-alist))))
</pre>



</div>

<div id="outline-container-18-5-1" class="outline-4">
<h4 id="sec-18-5-1">Agda</h4>
<div class="outline-text-4" id="text-18-5-1">




<pre class="example">(load-file (let ((coding-system-for-read 'utf-8))
                (shell-command-to-string "agda-mode locate")))
</pre>


</div>
</div>

</div>

<div id="outline-container-18-6" class="outline-3">
<h3 id="sec-18-6">Ocaml</h3>
<div class="outline-text-3" id="text-18-6">




<pre class="example">(add-to-list 'auto-mode-alist '("\\.ml[iylp]?" . tuareg-mode))
(autoload 'tuareg-mode "tuareg" "Major mode for editing OCaml code" t)
(autoload 'tuareg-run-ocaml "tuareg" "Run an inferior OCaml process." t)
(autoload 'ocamldebug "ocamldebug" "Run the OCaml debugger" t)
(setq tuareg-font-lock-symbols t)

;; Indent `=' like a standard keyword.
(setq tuareg-lazy-= t)
;; Indent [({ like standard keywords.
(setq tuareg-lazy-paren t)
;; No indentation after `in' keywords.
(setq tuareg-in-indent 0)

(add-hook 'tuareg-mode-hook
          ;; Turn on auto-fill minor mode.
          (lambda () (auto-fill-mode 1)))
</pre>


</div>

</div>

<div id="outline-container-18-7" class="outline-3">
<h3 id="sec-18-7">Python</h3>
<div class="outline-text-3" id="text-18-7">




<pre class="example">(require 'python-mode)
(require 'python-pep8)
(require 'python-pylint)
</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-02-04 19:15:43 CET</p>
<p class="author">Author: Ulf Ejlertsson</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
